Netology/src/DataProcessors/ПересчетПоступлений/ПересчетПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПересчетПоступлений</name>
</mdclass:DataProcessor>

Netology/src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Число</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Netology/src/DataProcessors/ПересчетПоступлений/Forms/Форма/Module.bsl
&НаСервере
Процедура ПересчитатьДокументыНаСервере()
	
	ВыборкаДокументы = Документы.ПоступлениеТоваровИУслуг.Выбрать(ДатаНачалаПериода, ДатаЗавершенияПериода);
	
	Пока ВыборкаДокументы.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументы.ПолучитьОбъект();
		Для Каждого СтрокаТЧ ИЗ ДокументОбъект.Товары Цикл
			СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		КонецЦикла;
		ДокументОбъект.Записать();
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДокументы(Команда)
	
	ПересчитатьДокументыНаСервере();
	
КонецПроцедуры
